emacs/setup/my-functions.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>my functions</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" type="text/css" href="../style.css"/>
</head>
<body>
<div id="content">
<h1 class="title">my functions</h1>
<div class="org-src-container">
<pre class="src src-elisp"><span class="org-comment-delimiter">;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;; </span><span class="org-comment">xx-re ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;</span>
(<span class="org-keyword">defun</span> <span class="org-function-name">xx-re</span> ()
  <span class="org-doc">"replace all newlines with one blank line in buffer"</span>
  (<span class="org-keyword">interactive</span>)
  (<span class="org-keyword">let</span> ((case-fold-search t))
    (goto-char (point-min))
    (<span class="org-keyword">while</span> (search-forward-regexp <span class="org-string">"[\n]"</span> nil t)
      (replace-match <span class="org-string">"\n\n"</span>))
    (goto-char (point-min))
    (<span class="org-keyword">while</span> (search-forward-regexp <span class="org-string">"[\n]\\{3,\\}"</span> nil t)
      (replace-match <span class="org-string">"\n\n"</span>))
    (goto-char (point-min))
    (<span class="org-keyword">while</span> (search-forward-regexp <span class="org-string">"</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">(</span></span><span class="org-string">[]\"')]?</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">)</span></span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">(</span></span><span class="org-string">[.?!]</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">)</span></span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">(</span></span><span class="org-string">[]\"')]?</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">)</span></span><span class="org-string"> +"</span> nil t)
      (replace-match <span class="org-string">"\\1\\2\\3  "</span>))
    (fill-region (point-min) (point-max))))

<span class="org-comment-delimiter">;;;;;;;;;;;;;;;;;;;;;;;;;;;;;; </span><span class="org-comment">xx-ascii ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">&#8220; &#8221; &#8217; &#8216; &#8211;  &#8230;</span>

(<span class="org-keyword">defun</span> <span class="org-function-name">xx-ascii</span> ()
  <span class="org-doc">"asciify quotation characters"</span>
  (<span class="org-keyword">interactive</span>)
  (<span class="org-keyword">let</span> ((case-fold-search t))
    (goto-char (point-min))
    (<span class="org-keyword">while</span> (search-forward-regexp <span class="org-string">"&#8220;"</span> nil t)
      (replace-match <span class="org-string">"\""</span>))
    (goto-char (point-min))
    (<span class="org-keyword">while</span> (search-forward-regexp <span class="org-string">"&#8221;"</span> nil t)
      (replace-match <span class="org-string">"\""</span>))
    (goto-char (point-min))
    (<span class="org-keyword">while</span> (search-forward-regexp <span class="org-string">"&#8217;"</span> nil t)
      (replace-match <span class="org-string">"'"</span>))
    (goto-char (point-min))
    (<span class="org-keyword">while</span> (search-forward-regexp <span class="org-string">"&#8216;"</span> nil t)
      (replace-match <span class="org-string">"'"</span>))
    (goto-char (point-min))
    (<span class="org-keyword">while</span> (search-forward-regexp <span class="org-string">"&#8211;"</span> t)
      (replace-match <span class="org-string">"-"</span>))
    (goto-char (point-min))
    (<span class="org-keyword">while</span> (search-forward-regexp <span class="org-string">"&#8230;"</span> nil t)
      (replace-match <span class="org-string">"..."</span>))))

<span class="org-comment-delimiter">;;;;;;;;;;;;;;;;;;;;;;;;;;;;; </span><span class="org-comment">xx-months ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;</span>
(<span class="org-keyword">defun</span> <span class="org-function-name">xx-months</span> ()
  <span class="org-doc">"enumerate months"</span>
  (<span class="org-keyword">interactive</span>)
  (<span class="org-keyword">let</span> ((case-fold-search t))
    (goto-char (point-min))
    (<span class="org-keyword">while</span> (search-forward-regexp <span class="org-string">"January"</span> nil t)
      (replace-match <span class="org-string">"01"</span>))
    (goto-char (point-min))
    (<span class="org-keyword">while</span> (search-forward-regexp <span class="org-string">"February"</span> nil t)
      (replace-match <span class="org-string">"02"</span>))
    (goto-char (point-min))
    (<span class="org-keyword">while</span> (search-forward-regexp <span class="org-string">"March"</span> nil t)
      (replace-match <span class="org-string">"03"</span>))
    (goto-char (point-min))
    (<span class="org-keyword">while</span> (search-forward-regexp <span class="org-string">"April"</span> nil t)
      (replace-match <span class="org-string">"04"</span>))
    (goto-char (point-min))
    (<span class="org-keyword">while</span> (search-forward-regexp <span class="org-string">"May"</span> nil t)
      (replace-match <span class="org-string">"05"</span>))
    (goto-char (point-min))
    (<span class="org-keyword">while</span> (search-forward-regexp <span class="org-string">"June"</span> nil t)
      (replace-match <span class="org-string">"06"</span>))
    (goto-char (point-min))
    (<span class="org-keyword">while</span> (search-forward-regexp <span class="org-string">"July"</span> nil t)
      (replace-match <span class="org-string">"07"</span>))
    (goto-char (point-min))
    (<span class="org-keyword">while</span> (search-forward-regexp <span class="org-string">"August"</span> nil t)
      (replace-match <span class="org-string">"08"</span>))
    (goto-char (point-min))
    (<span class="org-keyword">while</span> (search-forward-regexp <span class="org-string">"September"</span> nil t)
      (replace-match <span class="org-string">"09"</span>))
    (goto-char (point-min))
    (<span class="org-keyword">while</span> (search-forward-regexp <span class="org-string">"October"</span> nil t)
      (replace-match <span class="org-string">"10"</span>))
    (goto-char (point-min))
    (<span class="org-keyword">while</span> (search-forward-regexp <span class="org-string">"November"</span> nil t)
      (replace-match <span class="org-string">"11"</span>))
    (goto-char (point-min))
    (<span class="org-keyword">while</span> (search-forward-regexp <span class="org-string">"December"</span> nil t)
      (replace-match <span class="org-string">"12"</span>))))
</pre>
</div>

<p>
<a href="../setup.html">back</a>
</p>
</div>
</body>
</html>
